
## Plan Result (aat)




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.fpl_cafcass_api_subscription
  * azurerm_key_vault_secret.fpl_cafcass_api_subscription_key
  * module.fpl-cafcass-api-mgmt-api.azurerm_api_management_api.api
  * module.fpl-cafcass-api-mgmt-api.azurerm_api_management_product_api.link_to_product[0]
  * module.fpl-cafcass-api-mgmt-product.azurerm_api_management_product.product
  * module.fpl-cafcass-api-mgmt-product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]
  * module.fpl-cafcass-api-policy.azurerm_api_management_api_policy.api_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fpl_cafcass_api_subscription will be created
  + resource "azurerm_api_management_subscription" "fpl_cafcass_api_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "FPL Cafcass API Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_key_vault_secret.fpl_cafcass_api_subscription_key will be created
  + resource "azurerm_key_vault_secret" "fpl_cafcass_api_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fpl-case-service-aat/providers/Microsoft.KeyVault/vaults/fpl-aat"
      + name                    = "fpl-cafcass-api-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fpl-cafcass-api-mgmt-api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-stg"
      + api_type              = "http"
      + display_name          = "FPL Cafcass API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "fpl-cafcass-api"
      + path                  = "public-law-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "cft-aat-network-rg"
      + revision              = "1"
      + service_url           = "http://fpl-case-service-aat.service.core-compute-aat.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/fpl-cafcass-api.json"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.fpl-cafcass-api-mgmt-api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "fpl-cafcass-api"
      + id                  = (known after apply)
      + product_id          = "fpl-cafcass"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.fpl-cafcass-api-mgmt-product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-stg"
      + approval_required     = false
      + display_name          = "fpl-cafcass"
      + id                    = (known after apply)
      + product_id            = "fpl-cafcass"
      + published             = true
      + resource_group_name   = "cft-aat-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.fpl-cafcass-api-mgmt-product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-stg"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "fpl-cafcass"
      + resource_group_name = "cft-aat-network-rg"
    }

  # module.fpl-cafcass-api-policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-stg"
      + api_name            = "fpl-cafcass-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-aat-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
            
                    <choose>
                        <when condition="@(context.Operation.Id == "get-cases-data")">
                            <rate-limit-by-key calls="5" renewal-period="60" counter-key="get-case-data" />
                        </when>
                        <when condition="@(context.Operation.Id == "get-case-document")">
                            <rate-limit-by-key calls="600" renewal-period="60" counter-key="get-case-document" />
                        </when>
                        <when condition="@(context.Operation.Id == "documentUpload")">
                            <rate-limit-by-key calls="20" renewal-period="60" counter-key="documentUpload" />
                        </when>
                        <when condition="@(context.Operation.Id == "post-guardian-information")">
                            <rate-limit-by-key calls="20" renewal-period="60" counter-key="post-guardian-information" />
                        </when>
                    </choose>
                    <!-- validate access token -->
            <!--        <validate-jwt header-name="Authorization" failed-validation-httpcode="401" require-scheme="Bearer" require-signed-tokens="true">-->
            <!--            <openid-config url="https://idam-web-public.aat.platform.hmcts.net/o/.well-known/openid-configuration" />-->
            <!--            <audiences>-->
            <!--                <audience>fpl-case-service</audience>-->
            <!--            </audiences>-->
            <!--            <issuers>-->
            <!--                <issuer>https://forgerock-am.service.core-compute-idam-aat2.internal:8443/openam/oauth2/realms/root/realms/hmcts</issuer>-->
            <!--            </issuers>-->
            <!--        </validate-jwt>-->
            
                    <!-- generate totp -->
                    <set-variable name="client_id" value="api-gw" />
                    <set-variable name="client_secret" value="C5OI566EGMPHT3CC" />
                    <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ234567";
                            var bits = "C5OI566EGMPHT3CC".ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                            Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] & 0xf;
                            int truncatedHash = hash[offset] & 0x7f;
                            for (int i = 1; i < 4; i++)
                            {
                            truncatedHash <<= 8;
                            truncatedHash |= hash[offset + i] & 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString("D6");
                        }"/>
                    <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                        <set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
                        <set-method>POST</set-method>
                        <set-header name="Content-Type" exists-action="override">
                            <value>application/json</value>
                        </set-header>
                        <set-body>@{
                            return new JObject(
                            new JProperty("microservice", (string)context.Variables["client_id"]),
                            new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                            ).ToString();
                            }</set-body>
                    </send-request>
            
                    <set-header name="ServiceAuthorization" exists-action="override">
                        <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As<string>())</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":25,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->